app/views/games/show.html.slim

SELECT "characters".* FROM "characters" WHERE "characters"."game_id" = ?  [["game_id", 1]]
SELECT 1 AS one FROM "characters" WHERE "characters"."game_id" = ? LIMIT 1  [["game_id", 1]]
---
    #chars
      - if @game.characters.any?

SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
---
      - else
        - if !@game.characters.any?{|c| c.user.id == current_user.id }