app/controllers/characters_controller.rb

SELECT "games".* FROM "games"
---
    def set_game
      @game = Game.find params[:game_id]