app/controllers/chat_controller.rb

  def index
    @my_games = Game.where(creator_id: current_user.id)
    @current_games = Game.all
---
SELECT "games".* FROM "games" WHERE "games"."creator_id" = 2
SELECT "games".* FROM "games"