app/controllers/games_controller.rb

  def show
    @game = Game
      .includes(:characters)
      .includes(:rooms)
      .find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."game_id" = ?  [["game_id", 1]]

  def create
    @game = Game.new(game_params)
    @game.creator_id = current_user.id

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "creator_id", "deny_empty_requests", "desc", "name", "private", "tags", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @game.update(game_params)
---
UPDATE "games" SET "tags" = ?, "updated_at" = ? WHERE "games"."id" = 1  [["tags", "asdf, asdf asdf"], ["updated_at", Fri, 18 Apr 2014 15:34:31 UTC +00:00]]