app/controllers/lobby_controller.rb

SELECT "games".* FROM "games" WHERE "games"."creator_id" = 2
SELECT "games".* FROM "games"
---
  def index
    @my_games = Game.where(creator_id: current_user.id)
    @current_games = Game.all